app/controllers/articles_controller.rb

  def index
    articles = Article.recent.page(params[:page]).per(params[:per_page])
---
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]